app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activity = Activity.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def find_activity
        Activity.find(params[:id])