app/controllers/activities_controller.rb

    def index
        @user = User.find(@user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]