app/controllers/activities_controller.rb

    def index
        puts "++++ Activities: in index"
        puts "params:"
        puts params
        activity = Activity.find_by!(user_id: params[:user_id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]

    def create
        activity = Activity.create!(user_id: params[:user_id], date: params[:date], minutes: params[:minutes], notes: params[:notes])
---
INSERT INTO "activities" ("date", "minutes", "notes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "08/03/1989"], ["minutes", 1], ["notes", "Good session"], ["user_id", 1], ["created_at", "2022-11-22 20:45:50.840990"], ["updated_at", "2022-11-22 20:45:50.840990"]]

    def destroy
        puts "++++ Activities: in destroy"
        activity = find_activity
        activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]

    def find_activity
        puts "++++ Activities: in find_activity"
        Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]