app/controllers/users_controller.rb

  def create
      puts "=== in Users create"
      user = User.create!(user_params)
---
INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$12$ESghw6HQBODqOTjgGbgaBOpfmlgCcugiggQ97z51Ysap3RV2uRjkW"], ["created_at", "2022-11-17 21:56:16.351485"], ["updated_at", "2022-11-17 21:56:16.351485"]]